[
  {
    "date": "15 mai 2024",
    "day": "mercredi",
    "title": "Bienvenue sur mon Blog - Découvrez mon Parcours et mes Projets",
    "tags": ["INTRODUCTION", "WEB-DEVELOPMENT", "PORTFOLIO"],
    "description": "Dans cet article, je vous présente mon parcours, mes compétences, et les projets sur lesquels je travaille, notamment mon application 'Task Manager'.",
    "slug": "bienvenue-sur-mon-blog",
    "content": "<h4 class='text-weight-bold q-mb-lg'>Bienvenue sur mon Blog - Le Début d’une Nouvelle Aventure</h4><p class='text-weight-light text-body1 q-mb-xl'>Salut à tous et bienvenue sur mon blog ! Je m’appelle Thibault Guilhem, et je suis un développeur web autodidacte passionné par les technologies modernes du web. Ce blog est l’aboutissement de plusieurs années de travail acharné et de passion pour le développement web.</p><h5 class='text-weight-bold q-mb-lg'>Pourquoi ce blog ?</h5><p class='text-weight-light text-body1 q-mb-xl'>L’idée de créer ce blog m’est venue après avoir passé des heures à lire et à apprendre des blogs de développeurs, à regarder des tutoriels et à expérimenter avec divers projets. J’ai réalisé que partager mes connaissances, mes découvertes et mes expériences pourrait non seulement aider d’autres développeurs en herbe, mais aussi me permettre de continuer à apprendre et à grandir dans ce domaine.</p><h5 class='text-weight-bold q-mb-lg'>Les Sujets Abordés</h5><h6 class='q-mb-md'>Développement Web</h6><p class='text-weight-light text-body1 q-mb-xl'>Vous trouverez ici des articles détaillés sur le développement web, couvrant des technologies comme Next.js, React, Node.js, TypeScript, Tailwind CSS, et MongoDB. Que vous soyez débutant ou développeur expérimenté, j’espère que vous trouverez des informations utiles et inspirantes.</p><h6 class='q-mb-md'>Projets Personnels</h6><p class='text-weight-light text-body1 q-mb-xl'>Je partagerai également des mises à jour régulières sur mes projets personnels, notamment Task Manager. Vous pourrez suivre l’évolution de ce projet, découvrir les défis que je rencontre et les solutions que je mets en place. J’entrerai dans les détails techniques pour vous montrer comment j’utilise ces technologies pour créer des applications performantes et sécurisées.</p><h6 class='q-mb-md'>Astuces et Bonnes Pratiques</h6><p class='text-weight-light text-body1 q-mb-xl'>En plus des projets et des tutoriels, je partagerai des astuces et des bonnes pratiques que j’ai découvertes au fil de mes expériences. Que ce soit des conseils pour optimiser votre code, améliorer la sécurité de vos applications ou simplement des raccourcis pour être plus efficace, il y aura toujours quelque chose de nouveau à apprendre.</p><h6 class='q-mb-md'>Intelligence Artificielle et Outils Modernes</h6><p class='text-weight-light text-body1 q-mb-xl'>Étant un grand amateur des avancées technologiques, j’écrirai également sur des sujets comme l’intelligence artificielle et des outils modernes tels que ChatGPT et Copilot. Ces outils m’ont aidé à améliorer ma productivité et à explorer de nouvelles possibilités dans le développement web.</p><h6 class='q-mb-md'>Cinéma et Musique</h6><p class='text-weight-light text-body1 q-mb-xl'>Enfin, parce qu’un développeur a aussi besoin de se détendre, je partagerai mes coups de cœur cinéma et musique. C’est toujours intéressant de découvrir de nouvelles perspectives et de s’inspirer de différents domaines artistiques.</p><h5 class='text-weight-bold q-mb-lg'>Mon Premier Grand Projet : Task Manager</h5><p class='text-weight-light text-body1 q-mb-lg'>Je suis particulièrement fier de mon projet <span class='text-weight-medium'>Task Manager</span>, une application de gestion de tâches conçue pour être performante et sécurisée. Voici quelques-unes des fonctionnalités clés que vous pouvez attendre :</p><ul class='text-grey-5 text-body1'><li><span class='text-dark text-weight-light'><span class='text-weight-bold'>Gestion des tâches</span> : Créez, modifiez et supprimez des tâches facilement.</span></li><li><span class='text-dark text-weight-light'><span class='text-weight-bold'>Workspaces</span> : Travaillez en équipe en créant des espaces de travail dédiés.</span></li><li><span class='text-dark text-weight-light'><span class='text-weight-bold'>Sécurité</span> : Utilisation de pratiques de sécurité modernes pour protéger les données des utilisateurs.</span></li></ul><p class='text-weight-light text-body1 q-mb-xl'>Je documenterai tout le processus de développement de <span class='text-weight-medium'>Task Manager</span> sur ce blog, de la conception initiale aux défis techniques rencontrés, en passant par les succès obtenus.</p><h5 class='text-weight-bold q-mb-lg'>Conclusion</h5><p class='text-weight-light text-body1 q-mb-md'>Merci d’avoir pris le temps de lire cet article d’introduction. J’espère que vous trouverez ce blog utile et inspirant. N’hésitez pas à me contacter si vous avez des questions, des suggestions ou si vous souhaitez collaborer sur un projet.</p><p class='text-weight-light text-body1 q-mb-md'>Restez à l’écoute pour les prochains articles et n’oubliez pas de vous abonner pour ne rien manquer !</p><p class='text-weight-light text-body1'>À bientôt !</p>"
  },
  {
    "date": "5 août 2023",
    "day": "samedi",
    "title": "Lancement de Tailwind Nextjs Starter Blog v2.0",
    "tags": ["NEXT-JS", "TAILWIND", "GUIDE", "FEATURE"],
    "description": "Sortie du template Tailwind Nextjs Starter Blog v2.0, refactorisé avec le répertoire Nextjs App et l'installation des composants React Server. Découvrez les nouvelles fonctionnalités et comment migrer depuis la V1.",
    "slug": "lancement-tailwind-nextjs-v2",
    "content": "<h4 class='text-weight-bold q-mb-lg'>Introduction à Tailwind Nextjs Starter Blog v2.0</h4><p class='text-weight-light text-body1 q-mb-xl'>La nouvelle version de Tailwind Nextjs Starter Blog est enfin là ! Dans cet article, je vais vous présenter les nouveautés et les améliorations de cette version.</p><h5 class='text-weight-bold q-mb-lg'>Nouvelles Fonctionnalités</h5><ul class='text-grey-5 text-body1 q-mb-xl'><li><span class='text-dark text-weight-light'><span class='text-weight-bold'>Migration vers le répertoire Nextjs App.</span></span></li><li><span class='text-dark text-weight-light'><span class='text-weight-bold'>Installation des composants React Server.</span></span></li><li><span class='text-dark text-weight-light'><span class='text-weight-bold'>Refactorisation complète du code pour une meilleure performance.</span></span></li></ul><p class='text-weight-light text-body1 q-mb-xl'>Ces améliorations vous permettront de créer des blogs plus rapidement et plus efficacement. Suivez le guide pour migrer depuis la version précédente.</p>"
  },
  {
    "date": "7 août 2021",
    "day": "samedi",
    "title": "Nouvelles fonctionnalités dans la v1",
    "tags": ["NEXT-JS", "TAILWIND", "GUIDE"],
    "description": "Un aperçu des nouvelles fonctionnalités de la v1 - copie de blocs de code, auteurs multiples, mise en page du frontmatter, etc.",
    "slug": "nouvelles-fonctionnalites-v1",
    "content": "<h4 class='text-weight-bold q-mb-lg'>Fonctionnalités de la v1</h4><p class='text-weight-light text-body1 q-mb-xl'>La première version de notre projet apporte plusieurs fonctionnalités intéressantes :</p><ul class='text-grey-5 text-body1 q-mb-xl'><li><span class='text-dark text-weight-light'><span class='text-weight-bold'>Copie de blocs de code.</span></span></li><li><span class='text-dark text-weight-light'><span class='text-weight-bold'>Auteurs multiples.</span></span></li><li><span class='text-dark text-weight-light'><span class='text-weight-bold'>Mise en page du frontmatter.</span></span></li></ul><p class='text-weight-light text-body1 q-mb-xl'>Ces fonctionnalités ont été conçues pour améliorer votre expérience de développement et rendre votre workflow plus efficace.</p>"
  }
]
